########################################################### VALIDATION #################################################

validation.user.UniqueUsername=El nombre de usuario ya est\u00E1 en uso
validation.user.UniqueEmail=El email est\u00E1 en uso
validation.resetPassword.InvalidEmail=El email no es v\u00E1lido
validation.resetPassword.EmailNotValidated=El email no ha sido validado

############################################################# MAIL #############################################################

mail.emailConfirmation=Confirmar email.
mail.resendConfirmationEmail=Reenviar confirmaci\u00F3n de email
mail.newComment.subject=Nuevo comentario en tu post {0}
mail.newComment.header={0} ha recibido un comentario
mail.newComment.subTitile={0} dijo
mail.newComment.title=Nuevo comentario
mail.newComment.goToComment=Ve a revisar el comentario
mail.passwordReset.linkMessage=Restaurar contrase\u00F1a
mail.passwordReset.message=Si estas intentando restaurar tu contrase\u00F1a, aquí tienes tu Token de seguridad:
mail.passwordReset.header=Restaurar contrase\u00F1a
mail.passwordReset.subject=Moovify - Restauración de Contrase\u00F1a
mail.passwordReset.title=Restaurar contrase\u00F1a
mail.confirmation.subject=Moovify - Email de Confirmación
mail.confirmation.header=Bienvenido a Moovify. Estamos muy felices que hayas decidido unirte a nuestra familia.
mail.confirmation.message=Para habilitar todas nuestras funcionalidades debes verificar tu cuenta. Aquí tienes el Token, cópialo y pégalo en la sección requerida en tu perfil
mail.confirmation.confirmLink=Confirmar email
mail.confirmation.title=Email de confirmaci\u00F3n
mail.resetPasswordTokenGenerated.body=Sigue el link incluido para terminar de restaurar tu contrase\u00F1a.
mail.registrationConfirm.title=Felicitaciones {0}, tu email ha sido confirmado correctamente!
mail.registrationConfirm.body=Ahora podras acceder a todas las funcionalidades de Moovify.
mail.errorResendEmail=El link que estas intentando usar no es v\u00E1lido :(
mail.registrationConfirm.goHome=Volver al inicio
mail.registrationConfirm.createPost=Crear un post
mail.registrationConfirm.countdown=Redirigiendo al inicio en
mail.errorResendEmail.body=Si deseas que lo reenviemos puedes solicitarlo desde tu 
mail.errorResendEmail.resendEmail=perfil.
mail.resendConfirmation.title=El email de confirmaci\u00F3n ha sido reenviado
mail.resendConfirmation.body=Email enviado a {0}

############################################################# EXCEPTIONS #############################################################

error.moovifyErrorTitle=Moovify | {0}
error.errorWithCode=ERROR {0}
error.goBack=Volver al inicio
error.postNotFoundException=El post que estabas tratando de buscar no existe. Asegurate que la informaci\u00F3n provista es correcta
error.movieNotFoundException=La pel\u00EDcula que estabas tratando de buscar no existe. Asegurate que la informaci\u00F3n provista es correcta
error.commentNotFoundException=El comentario que estabas tratando de buscar no existe. Asegurate que la informaci\u00F3n provista es correcta
error.userNotFoundException=El usuario que estabas tratando de buscar no existe. Asegurate que la informaci\u00F3n provista es correcta
error.defaultMessage=Parece haber un error con tu pedido. Puedes intentar yendo hacia atr\u00E1s o comenzando denuevo desde la p\u00E1gina de inicio.
error.noHandlerFoundException=La URL provista no parece ser v\u00E1lida. Puedes intentar yendo hacia atras o comenzando denuevo desde la p\u00E1gina de inicio.
error.invalidSearchArgumentsException=Los argumentos provistos para la b\u00FAsqueda no son validos. Asegurate de estar escribiendo la informaci\u00F3n correcta.
error.accessDeniedException=No puedes realizar esta acci\u00F3n.
error.invalidPostCategoryException=La categor\u00EDa del post seleccionada no es correcta. Asegurate de estar escribiendo la informaci\u00F3n correcta.
error.nonExistingSearchCriteriaException=El orden provisto para la b\u00FAsqueda no es correcto. Asegurate de estar escribiendo la informaci\u00F3n correcta.
error.invalidMovieIdException=La pel\u00EDcula seleccionada no es correcta. Asegurate de estar escribiendo la informaci\u00F3n correcta.
error.invalidPaginationArgumentException=Los argumentos de paginaci\u00F3n provistos (N\u00FAmero de p\u00E1gina/Tama\u00F1o de p\u00E1gina) no son correctos. Asegurate de estar escribiendo la informaci\u00F3n correcta.
error.invalidRoleException=El rol del usuario provisto no es correcto. Asegurate de estar escribiendo la informaci\u00F3n correcta.
error.DeletedDisabledModelException=Intentaste eliminar una entidad que ya estaba eliminada.
error.RestoredEnabledModelException=Intentaste restaurar una entidad que ya estaba restaurada.
error.IllegalCommentLikeException=El comentario en el que intentas votar no es v\u00E1lido.
error.IllegalPostLikeException=El post en el que intentas votar no es v\u00E1lido.
error.InvalidUserPromotionException=Trataste de promover un usuario inv\u00E1lido
error.missingPostEditPermissionException=No tienes autorización para editar este post
error.missingCommentEditPermissionException=No tienes autorización para editar este post
error.illegalUserFollowException=Intentaste seguir a un usuario invalido
error.illegalUserUnfollowException=Intentaste dejar de seguir a un usuario invalido
error.illegalCommentEditionException=Intentaste editar un comentario invalido
error.illegalPostEditionException=Intentaste editar un post invalido
error.illegalPostBookmarkException=Intentaste guardar un post invalido
error.illegalPostUnbookmarkException=Intentaste des-guardar un post invalido
error.invalidSortCriteriaException=Especificaste un ordenamiento invalido
error.avatarNotFoundException=El avatar que intentaste acceder no existe
error.posterNotFoundException=El poster al cual intentaste acceder no existe
error.invalidResetPasswordTokenException=El token de reseteo de contraseña no es valido
error.forbiddenEntityRelationshipAccessException=Intentaste acceder a informacion de una entidad deshabilitada
error.invalidEmailConfirmationTokenException=El token de confirmacion de email no es valido
error.DuplicateUniqueUserAttributeException=El usuario que intentaste crear poseia atributos unicos duplicados
error.payloadRequiredException=Este método requiere de un paquete

error.invalidResetPasswordEmail=Email de reseteo de password no pertenece a ningun usuario
error.notValidatedResetPasswordEmail=Email de reseteo de password no fue previamente confirmado
error.refreshJwt=Token de refresco invalido








